; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.1 }
%union.anon.1 = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.icmphdr = type { i8, i8, i16, %union.anon.5 }
%union.anon.5 = type { i32 }
%struct.icmp6hdr = type { i8, i8, i16, %union.anon.8 }
%union.anon.8 = type { [1 x i32] }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !59

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !73, line: 16, type: !74, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !58, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/ubuntu/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "da860faf0d5013ecd297624339b141a7")
!4 = !{!5, !14, !21}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/ubuntu/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "db1ce4e5e29770657167bc8f57af9388")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "count", file: !3, line: 21, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "V_LAN", value: 0)
!17 = !DIEnumerator(name: "IPV4", value: 1)
!18 = !DIEnumerator(name: "ICMP", value: 2)
!19 = !DIEnumerator(name: "TCP", value: 3)
!20 = !DIEnumerator(name: "UDP", value: 4)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 28, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!24 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!25 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!26 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!27 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!28 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!29 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!30 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!31 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!32 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!33 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!34 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!35 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!36 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!37 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!38 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!39 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!40 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!41 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!42 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!43 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!44 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!45 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!46 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!47 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!48 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!49 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!50 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!51 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !56, line: 24, baseType: !57)
!56 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !{!0, !59, !65}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 441, type: !61, isLocal: false, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32, elements: !63)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!63 = !{!64}
!64 = !DISubrange(count: 4)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !67, line: 33, type: !68, isLocal: true, isDefinition: true)
!67 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/ubuntu/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "2601bcf9d7985cb46bfbd904b60f5aaf")
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!53, !53, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!73 = !DIFile(filename: "./xdp_stats_kern.h", directory: "/home/ubuntu/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "0f65d57b07088eec24d5031993b90668")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !75, line: 33, size: 160, elements: !76)
!75 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/ubuntu/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "9e37b5f46a8fb7f5ed35ab69309bf15d")
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 34, baseType: !7, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !74, file: !75, line: 35, baseType: !7, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !74, file: !75, line: 36, baseType: !7, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !75, line: 37, baseType: !7, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !74, file: !75, line: 38, baseType: !7, size: 32, offset: 128)
!82 = !{i32 7, !"Dwarf Version", i32 5}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{i32 7, !"frame-pointer", i32 2}
!86 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!87 = distinct !DISubprogram(name: "xdp_parser_func", scope: !3, file: !3, line: 278, type: !88, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !100)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !91}
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !93)
!93 = !{!94, !96, !97, !98, !99}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !6, line: 2857, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !56, line: 27, baseType: !7)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !92, file: !6, line: 2858, baseType: !95, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !92, file: !6, line: 2859, baseType: !95, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !92, file: !6, line: 2861, baseType: !95, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !92, file: !6, line: 2862, baseType: !95, size: 32, offset: 128)
!100 = !{!101, !102, !103, !104, !118, !148, !191, !200, !222, !246, !289, !294, !303, !304, !305, !306, !310, !311, !312, !317, !320}
!101 = !DILocalVariable(name: "ctx", arg: 1, scope: !87, file: !3, line: 278, type: !91)
!102 = !DILocalVariable(name: "data_end", scope: !87, file: !3, line: 280, type: !53)
!103 = !DILocalVariable(name: "data", scope: !87, file: !3, line: 281, type: !53)
!104 = !DILocalVariable(name: "eth", scope: !87, file: !3, line: 282, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !107, line: 168, size: 112, elements: !108)
!107 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!108 = !{!109, !114, !115}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !106, file: !107, line: 169, baseType: !110, size: 48)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 48, elements: !112)
!111 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!112 = !{!113}
!113 = !DISubrange(count: 6)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !106, file: !107, line: 170, baseType: !110, size: 48, offset: 48)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !106, file: !107, line: 171, baseType: !116, size: 16, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !117, line: 25, baseType: !55)
!117 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!118 = !DILocalVariable(name: "iph", scope: !87, file: !3, line: 283, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !121, line: 87, size: 160, elements: !122)
!121 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!122 = !{!123, !125, !126, !127, !128, !129, !130, !131, !132, !134}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !120, file: !121, line: 89, baseType: !124, size: 4, flags: DIFlagBitField, extraData: i64 0)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !56, line: 21, baseType: !111)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !120, file: !121, line: 90, baseType: !124, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !120, file: !121, line: 97, baseType: !124, size: 8, offset: 8)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !120, file: !121, line: 98, baseType: !116, size: 16, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !120, file: !121, line: 99, baseType: !116, size: 16, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !120, file: !121, line: 100, baseType: !116, size: 16, offset: 48)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !120, file: !121, line: 101, baseType: !124, size: 8, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !120, file: !121, line: 102, baseType: !124, size: 8, offset: 72)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !120, file: !121, line: 103, baseType: !133, size: 16, offset: 80)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !117, line: 31, baseType: !55)
!134 = !DIDerivedType(tag: DW_TAG_member, scope: !120, file: !121, line: 104, baseType: !135, size: 64, offset: 96)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !121, line: 104, size: 64, elements: !136)
!136 = !{!137, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !135, file: !121, line: 104, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !135, file: !121, line: 104, size: 64, elements: !139)
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !138, file: !121, line: 104, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !117, line: 27, baseType: !95)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !138, file: !121, line: 104, baseType: !141, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !135, file: !121, line: 104, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !135, file: !121, line: 104, size: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !144, file: !121, line: 104, baseType: !141, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !144, file: !121, line: 104, baseType: !141, size: 32, offset: 32)
!148 = !DILocalVariable(name: "ipv6hdr", scope: !87, file: !3, line: 284, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !151, line: 118, size: 320, elements: !152)
!151 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "9926d49458ea1e0cc4651362e733e03e")
!152 = !{!153, !154, !155, !159, !160, !161, !162}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !150, file: !151, line: 120, baseType: !124, size: 4, flags: DIFlagBitField, extraData: i64 0)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !150, file: !151, line: 121, baseType: !124, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !150, file: !151, line: 128, baseType: !156, size: 24, offset: 8)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 24, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 3)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !150, file: !151, line: 130, baseType: !116, size: 16, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !150, file: !151, line: 131, baseType: !124, size: 8, offset: 48)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !150, file: !151, line: 132, baseType: !124, size: 8, offset: 56)
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !150, file: !151, line: 134, baseType: !163, size: 256, offset: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !150, file: !151, line: 134, size: 256, elements: !164)
!164 = !{!165, !186}
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !151, line: 134, baseType: !166, size: 256)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !151, line: 134, size: 256, elements: !167)
!167 = !{!168, !185}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !166, file: !151, line: 134, baseType: !169, size: 128)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !170, line: 33, size: 128, elements: !171)
!170 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !169, file: !170, line: 40, baseType: !173, size: 128)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 34, size: 128, elements: !174)
!174 = !{!175, !179, !183}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !173, file: !170, line: 35, baseType: !176, size: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !173, file: !170, line: 37, baseType: !180, size: 128)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !173, file: !170, line: 38, baseType: !184, size: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !63)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !166, file: !151, line: 134, baseType: !169, size: 128, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !163, file: !151, line: 134, baseType: !187, size: 256)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !151, line: 134, size: 256, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !187, file: !151, line: 134, baseType: !169, size: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !187, file: !151, line: 134, baseType: !169, size: 128, offset: 128)
!191 = !DILocalVariable(name: "udphdr", scope: !87, file: !3, line: 285, type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !194, line: 23, size: 64, elements: !195)
!194 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!195 = !{!196, !197, !198, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !193, file: !194, line: 24, baseType: !116, size: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !193, file: !194, line: 25, baseType: !116, size: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !193, file: !194, line: 26, baseType: !116, size: 16, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !193, file: !194, line: 27, baseType: !133, size: 16, offset: 48)
!200 = !DILocalVariable(name: "tcphdr", scope: !87, file: !3, line: 286, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !203, line: 25, size: 160, elements: !204)
!203 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !202, file: !203, line: 26, baseType: !116, size: 16)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !202, file: !203, line: 27, baseType: !116, size: 16, offset: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !202, file: !203, line: 28, baseType: !141, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !202, file: !203, line: 29, baseType: !141, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !202, file: !203, line: 31, baseType: !55, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !202, file: !203, line: 32, baseType: !55, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !202, file: !203, line: 33, baseType: !55, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !202, file: !203, line: 34, baseType: !55, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !202, file: !203, line: 35, baseType: !55, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !202, file: !203, line: 36, baseType: !55, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !202, file: !203, line: 37, baseType: !55, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !202, file: !203, line: 38, baseType: !55, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !202, file: !203, line: 39, baseType: !55, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !202, file: !203, line: 40, baseType: !55, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !202, file: !203, line: 55, baseType: !116, size: 16, offset: 112)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !202, file: !203, line: 56, baseType: !133, size: 16, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !202, file: !203, line: 57, baseType: !116, size: 16, offset: 144)
!222 = !DILocalVariable(name: "icmphdr", scope: !87, file: !3, line: 287, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !225, line: 89, size: 64, elements: !226)
!225 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !225, line: 90, baseType: !124, size: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !224, file: !225, line: 91, baseType: !124, size: 8, offset: 8)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !224, file: !225, line: 92, baseType: !133, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !224, file: !225, line: 104, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !224, file: !225, line: 93, size: 32, elements: !232)
!232 = !{!233, !238, !239, !244}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !231, file: !225, line: 97, baseType: !234, size: 32)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !225, line: 94, size: 32, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !234, file: !225, line: 95, baseType: !116, size: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !234, file: !225, line: 96, baseType: !116, size: 16, offset: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !231, file: !225, line: 98, baseType: !141, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !231, file: !225, line: 102, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !225, line: 99, size: 32, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !240, file: !225, line: 100, baseType: !116, size: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !240, file: !225, line: 101, baseType: !116, size: 16, offset: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !231, file: !225, line: 103, baseType: !245, size: 32)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !63)
!246 = !DILocalVariable(name: "icmp6hdr", scope: !87, file: !3, line: 288, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !249, line: 8, size: 64, elements: !250)
!249 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!250 = !{!251, !252, !253, !254}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !248, file: !249, line: 10, baseType: !124, size: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !248, file: !249, line: 11, baseType: !124, size: 8, offset: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !248, file: !249, line: 12, baseType: !133, size: 16, offset: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !248, file: !249, line: 63, baseType: !255, size: 32, offset: 32)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !249, line: 15, size: 32, elements: !256)
!256 = !{!257, !261, !265, !266, !271, !279}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !255, file: !249, line: 16, baseType: !258, size: 32)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 32, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 1)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !255, file: !249, line: 17, baseType: !262, size: 32)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 2)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !255, file: !249, line: 18, baseType: !245, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !255, file: !249, line: 23, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !249, line: 20, size: 32, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !267, file: !249, line: 21, baseType: !116, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !267, file: !249, line: 22, baseType: !116, size: 16, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !255, file: !249, line: 40, baseType: !272, size: 32)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !249, line: 25, size: 32, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !272, file: !249, line: 27, baseType: !95, size: 5, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !272, file: !249, line: 28, baseType: !95, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !272, file: !249, line: 29, baseType: !95, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !272, file: !249, line: 30, baseType: !95, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !272, file: !249, line: 31, baseType: !95, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !255, file: !249, line: 61, baseType: !280, size: 32)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !249, line: 42, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !280, file: !249, line: 43, baseType: !124, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !280, file: !249, line: 45, baseType: !124, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !280, file: !249, line: 46, baseType: !124, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !280, file: !249, line: 47, baseType: !124, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !280, file: !249, line: 48, baseType: !124, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !280, file: !249, line: 49, baseType: !124, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !280, file: !249, line: 60, baseType: !116, size: 16, offset: 16)
!289 = !DILocalVariable(name: "vlans", scope: !87, file: !3, line: 289, type: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !3, line: 50, size: 32, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !3, line: 51, baseType: !293, size: 32)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !263)
!294 = !DILocalVariable(name: "rec", scope: !87, file: !3, line: 290, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !297, line: 10, size: 128, elements: !298)
!297 = !DIFile(filename: "./xdp_stats_kern_user.h", directory: "/home/ubuntu/xdp-tutorial/packet01-parsing", checksumkind: CSK_MD5, checksum: "96c2435685fa7da2d24f219444d8659d")
!298 = !{!299, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !296, file: !297, line: 11, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !56, line: 31, baseType: !301)
!301 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !296, file: !297, line: 12, baseType: !300, size: 64, offset: 64)
!303 = !DILocalVariable(name: "counts", scope: !87, file: !3, line: 292, type: !95)
!304 = !DILocalVariable(name: "bytes", scope: !87, file: !3, line: 293, type: !300)
!305 = !DILocalVariable(name: "action", scope: !87, file: !3, line: 298, type: !95)
!306 = !DILocalVariable(name: "nh", scope: !87, file: !3, line: 301, type: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !3, line: 33, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !307, file: !3, line: 34, baseType: !53, size: 64)
!310 = !DILocalVariable(name: "eth_type", scope: !87, file: !3, line: 302, type: !90)
!311 = !DILocalVariable(name: "ip_type", scope: !87, file: !3, line: 302, type: !90)
!312 = !DILocalVariable(name: "seq", scope: !313, file: !3, line: 391, type: !90)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 386, column: 34)
!314 = distinct !DILexicalBlock(scope: !315, file: !3, line: 386, column: 10)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 372, column: 12)
!316 = distinct !DILexicalBlock(scope: !87, file: !3, line: 358, column: 5)
!317 = !DILocalVariable(name: "seq", scope: !318, file: !3, line: 412, type: !90)
!318 = distinct !DILexicalBlock(scope: !319, file: !3, line: 407, column: 2)
!319 = distinct !DILexicalBlock(scope: !314, file: !3, line: 406, column: 11)
!320 = !DILabel(scope: !87, name: "out", file: !3, line: 437)
!321 = !DILocation(line: 0, scope: !87)
!322 = !DILocation(line: 280, column: 38, scope: !87)
!323 = !{!324, !325, i64 4}
!324 = !{!"xdp_md", !325, i64 0, !325, i64 4, !325, i64 8, !325, i64 12, !325, i64 16}
!325 = !{!"int", !326, i64 0}
!326 = !{!"omnipotent char", !327, i64 0}
!327 = !{!"Simple C/C++ TBAA"}
!328 = !DILocation(line: 280, column: 27, scope: !87)
!329 = !DILocation(line: 280, column: 19, scope: !87)
!330 = !DILocation(line: 281, column: 34, scope: !87)
!331 = !{!324, !325, i64 0}
!332 = !DILocation(line: 281, column: 23, scope: !87)
!333 = !DILocation(line: 281, column: 15, scope: !87)
!334 = !DILocation(line: 292, column: 2, scope: !87)
!335 = !DILocation(line: 292, column: 8, scope: !87)
!336 = !{!325, !325, i64 0}
!337 = !DILocation(line: 293, column: 25, scope: !87)
!338 = !DILocalVariable(name: "nh", arg: 1, scope: !339, file: !3, line: 103, type: !342)
!339 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !3, file: !3, line: 103, type: !340, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !345)
!340 = !DISubroutineType(types: !341)
!341 = !{!90, !342, !53, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!345 = !{!338, !346, !347, !348, !349, !350, !351, !357, !358}
!346 = !DILocalVariable(name: "data_end", arg: 2, scope: !339, file: !3, line: 104, type: !53)
!347 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !339, file: !3, line: 105, type: !343)
!348 = !DILocalVariable(name: "vlans", arg: 4, scope: !339, file: !3, line: 106, type: !344)
!349 = !DILocalVariable(name: "eth", scope: !339, file: !3, line: 108, type: !105)
!350 = !DILocalVariable(name: "hdrsize", scope: !339, file: !3, line: 109, type: !90)
!351 = !DILocalVariable(name: "vlh", scope: !339, file: !3, line: 110, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !3, line: 37, size: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !353, file: !3, line: 38, baseType: !116, size: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !353, file: !3, line: 39, baseType: !116, size: 16, offset: 16)
!357 = !DILocalVariable(name: "h_proto", scope: !339, file: !3, line: 111, type: !55)
!358 = !DILocalVariable(name: "i", scope: !339, file: !3, line: 112, type: !90)
!359 = !DILocation(line: 0, scope: !339, inlinedAt: !360)
!360 = distinct !DILocation(line: 317, column: 13, scope: !87)
!361 = !DILocation(line: 120, column: 15, scope: !362, inlinedAt: !360)
!362 = distinct !DILexicalBlock(scope: !339, file: !3, line: 120, column: 7)
!363 = !DILocation(line: 120, column: 25, scope: !362, inlinedAt: !360)
!364 = !DILocation(line: 120, column: 7, scope: !339, inlinedAt: !360)
!365 = !DILocation(line: 126, column: 10, scope: !339, inlinedAt: !360)
!366 = !DILocation(line: 129, column: 17, scope: !339, inlinedAt: !360)
!367 = !{!368, !369, i64 12}
!368 = !{!"ethhdr", !326, i64 0, !326, i64 6, !369, i64 12}
!369 = !{!"short", !326, i64 0}
!370 = !DILocalVariable(name: "h_proto", arg: 1, scope: !371, file: !3, line: 64, type: !55)
!371 = distinct !DISubprogram(name: "proto_is_vlan", scope: !3, file: !3, line: 64, type: !372, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{!90, !55}
!374 = !{!370}
!375 = !DILocation(line: 0, scope: !371, inlinedAt: !376)
!376 = distinct !DILocation(line: 135, column: 8, scope: !377, inlinedAt: !360)
!377 = distinct !DILexicalBlock(scope: !378, file: !3, line: 135, column: 7)
!378 = distinct !DILexicalBlock(scope: !379, file: !3, line: 134, column: 39)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 134, column: 2)
!380 = distinct !DILexicalBlock(scope: !339, file: !3, line: 134, column: 2)
!381 = !DILocation(line: 66, column: 20, scope: !371, inlinedAt: !376)
!382 = !DILocation(line: 66, column: 46, scope: !371, inlinedAt: !376)
!383 = !DILocation(line: 135, column: 8, scope: !377, inlinedAt: !360)
!384 = !DILocation(line: 135, column: 7, scope: !378, inlinedAt: !360)
!385 = !DILocation(line: 141, column: 18, scope: !378, inlinedAt: !360)
!386 = !{!387, !369, i64 2}
!387 = !{!"vlan_hdr", !369, i64 0, !369, i64 2}
!388 = !DILocation(line: 143, column: 4, scope: !389, inlinedAt: !360)
!389 = distinct !DILexicalBlock(scope: !378, file: !3, line: 142, column: 7)
!390 = !DILocation(line: 323, column: 24, scope: !391)
!391 = distinct !DILexicalBlock(scope: !87, file: !3, line: 323, column: 5)
!392 = !DILocation(line: 0, scope: !371, inlinedAt: !393)
!393 = distinct !DILocation(line: 323, column: 5, scope: !391)
!394 = !DILocation(line: 66, column: 20, scope: !371, inlinedAt: !393)
!395 = !DILocation(line: 66, column: 46, scope: !371, inlinedAt: !393)
!396 = !DILocation(line: 323, column: 5, scope: !87)
!397 = !DILocation(line: 325, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !391, file: !3, line: 323, column: 33)
!399 = !DILocation(line: 326, column: 13, scope: !400)
!400 = distinct !DILexicalBlock(scope: !398, file: !3, line: 326, column: 13)
!401 = !DILocation(line: 326, column: 13, scope: !398)
!402 = !DILocation(line: 328, column: 18, scope: !403)
!403 = distinct !DILexicalBlock(scope: !400, file: !3, line: 327, column: 9)
!404 = !DILocation(line: 328, column: 29, scope: !403)
!405 = !{!406, !407, i64 0}
!406 = !{!"datarec", !407, i64 0, !407, i64 8}
!407 = !{!"long long", !326, i64 0}
!408 = !DILocation(line: 329, column: 18, scope: !403)
!409 = !DILocation(line: 329, column: 27, scope: !403)
!410 = !{!406, !407, i64 8}
!411 = !DILocation(line: 330, column: 9, scope: !403)
!412 = !DILocation(line: 333, column: 6, scope: !87)
!413 = !DILocation(line: 335, column: 9, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !3, line: 333, column: 38)
!415 = distinct !DILexicalBlock(scope: !87, file: !3, line: 333, column: 6)
